DIYbitcoin/kiss-signer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- camera (step 2 spike): OV02C10 over MIPI-CSI (the sensor Guition actually
# ships on this board's ribbon; SCCB addr 0x36 on the shared touch I2C bus),
# RAW10 1920x1080 2-lane, ISP -> RGB565 ---
CONFIG_CAMERA_OV02C10=y
CONFIG_CAMERA_OV02C10_MIPI_RAW10_1288x728_30FPS=y
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n

# The ISP pipeline controller: the task that reads the ISP's own statistics
# every frame and drives sensor exposure, gain and white balance from them.
# Without it the tuning file is inert, the sensor holds its power on exposure
# for the whole session, and the white balance never moves off its default.
#
# Its stack stays in internal DRAM. PSRAM is offered and we do not take it:
# upstream recommends DRAM unless internal memory is severely constrained, and
# ours is not. Revisit only with a measurement, not a hunch.
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_LV_USE_QRCODE=y
CONFIG_FATFS_LFN_HEAP=y
